["## Privacy Policy for Galactic Dash",

"Effective Date: 2024-03-28",

"## Introduction",

"This privacy policy (\"Policy\") describes how EnchantedCanvas (\"we\", \"us\", or \"our\") collects, uses, and discloses your information in connection with your use of our mobile game, Galactic Dash (the \"Game\"),",

"## Information We Collect",

"We collect two types of information in connection with the Game:",

"* Non-Personal Information: This information does not personally identify you. It may include information about your device, such as your device model, operating system, system information, and IP address. It may also include gameplay information, such as progress, scores, and achievements,",
"* Optional Personal Information: We may collect certain personal information if you choose to provide it to us. This may include things like your email address if you contact us for support, or a username you create if the game offers account functionality,",

"## How We Use Your Information",

"We use the information we collect to:",

"* Operate and improve the Game,",
"* Send you push notifications (with your consent),",

"## Sharing Your Information",

"We may share your information with third-party service providers who help us operate the Game, such as Google Play and Google Adsense platforms respectively. These service providers are contractually obligated to keep your information confidential and to use it only for the purposes we have specified,",

"We will not share your personal information with third-party advertisers without your consent,",

"## Children's Privacy",

"We do not knowingly collect personal information from children under the age of 13. If you are a parent or guardian and you believe your child has provided us with personal information, please contact us at data@enchantedcanvas.net. We will delete any personal information we have collected from a child under 13,",

"## Data Security",

"We take reasonable steps to protect your information from unauthorised access, disclosure, alteration, or destruction. However, no Internet transmission or electronic storage is completely secure. We cannot guarantee the security of your information,",

"## Your Rights",

"You have certain rights concerning your information, including:",

"* The right to access your information,",
"* The right to rectify inaccurate information,",
"* The right to request the deletion of your information,",
"* The right to object to the processing of your information,",
"* The right to withdraw your consent to process your information (where applicable),",

"## Changes to this Policy",

"We may update this Policy from time to time. We will notify you of any changes by posting the new Policy on the Game,",

"## Contact Us",

"If you have any questions about this Policy, please contact us at data@enchantedcanvas.net,",

"## In-App Purchases",

"When you make an In-App Purchase, Google Play's secure payment system handles your financial data and any user information associated with the purchase. You can find more information about Google Play's security practices here: https://support.google.com/googleplay/android-developer/answer/9858738,"
]